# Vzglyad-Detect 
# Parameters
nc: 80 # number of classes
scale: n # Default scale (n, s, m, l, x)
reg_max: 16 # DFL bins 

scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]


backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]      # 2 (using C2f instead of C3k2 for unique structure)
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 6, C2f, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C2f, [1024, True]]     # 8
  - [-1, 1, C2PSA, [1024]]         # 9
  - [-1, 1, SPPF, [1024, 5]]       # 10

# Custom Vzglyad Neck & Head (Modified PANet)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]      # cat P4
  - [-1, 3, C2f, [512, False]]     # 13
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]      # cat P3
  - [-1, 3, C2f, [256, False]]     # 16 (P3/8 output)
  
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]     # cat P4
  - [-1, 3, C2f, [512, False]]     # 19 (P4/16 output)
  
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]     # cat P5
  - [-1, 3, C2f, [1024, False]]    # 22 (P5/32 output)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
